{
  "\t\t": 50294,
  "\t\t\t": 50293,
  "\t\t\t\t": 50292,
  "\t\t\t\t\t": 50291,
  "\t\t\t\t\t\t": 50290,
  "\t\t\t\t\t\t\t": 50289,
  "\t\t\t\t\t\t\t\t": 50288,
  "\t\t\t\t\t\t\t\t\t": 50287,
  "  ": 50286,
  "   ": 50285,
  "    ": 50284,
  "     ": 50283,
  "      ": 50282,
  "       ": 50281,
  "        ": 50280,
  "         ": 50279,
  "          ": 50278,
  "           ": 50277,
  "            ": 50276,
  "             ": 50275,
  "              ": 50274,
  "               ": 50273,
  "                ": 50272,
  "                 ": 50271,
  "                  ": 50270,
  "                   ": 50269,
  "                    ": 50268,
  "                     ": 50267,
  "                      ": 50266,
  "                       ": 50265,
  "                        ": 50264,
  "                         ": 50263,
  "                          ": 50262,
  "                           ": 50261,
  "                            ": 50260,
  "                             ": 50259,
  "                              ": 50258,
  "                               ": 50257
}
